# ClosePoly

## Description
Procedures ClosePoly set the polygon creation mode for polygon objects created in VectorScript to closed. To turn this mode off, use Procedure OpenPoly; the two modes used in conjunction will act as a toggle for the feature.

```pascal
PROCEDURE ClosePoly;
```

```python
def vs.ClosePoly():
    return None
```

## Examples
#### VectorScript ####
```pascal
ClosePoly;
Poly(0,0,1,1,1,-1);
{creates a closed 3 sided polygon}
```
#### Python ####
```python
vs.ClosePoly()
vs.Poly(0,0,1,1,1,-1)
#{creates a closed 3 sided polygon}
```

```pascal
ClosePoly;
```
```python
vs.MoveTo(0,0)
vs.ClosePoly()
vs.BeginPoly()
vs.MoveTo( -0.5 * dMmarkerSize, 0.5 * dMmarkerSize )
vs.ArcTo( 	0,1 * dMmarkerSize, 0 )
vs.LineTo( 	0.5 * dMmarkerSize, 0.5 * dMmarkerSize )

vs.Absolute()
vs.MoveTo( 0.0, 0.0 )
vs.Relative()
vs.ClosePoly()

# Draw paving
vs.ClosePoly()
vs.BeginPoly()
vs.AddPoint( p4 )
vs.AddPoint( p3 )
vs.AddPoint( p6 )
```

## See Also
<listTable indent="1" cols="4">
AddPoint
ArcTo
BeginPoly
ClosePoly
CurveThrough
CurveTo
DelVertex
EndPoly
GetHole
GetNumHoles
GetPolylineVertex
GetPolyPt
GetVertexVisibility
GetVertNum
InsertVertex
OpenPoly
Poly
SetPolylineVertex
SetPolyPt
SetVertexVisibility
Smooth
</listTable>

## Version
Availability: from All Versions

## Category
* Objects - Polys